{
    "day": 1,
    "topic": "Relative Clauses 1: Clauses with who/that/which",
    "sections": [
      {
        "title": "Introduction",
        "content": "Welcome to Unit 92 of our English learning journey. In this unit, we'll explore the concept of relative clauses, specifically focusing on clauses introduced by 'who,' 'that,' and 'which.' "
      },
      {
        "title": "Definition",
        "content": "Understanding how to use these relative pronouns enhances your ability to provide additional information about a noun. Let's delve into the key concepts."
      },
      {
        "title": "'Introduction to Relative Clauses",
        "content": "Understand the purpose of relative clauses in providing additional information about a noun.",
        "points": [
          "The woman who is sitting there is my sister"
        ]
      },
      {
        "title": "Relative Pronouns",
        "content": "Relative Pronouns 'Who,' 'That,'' and 'Which'",
        "points": [
          "Explore the use of 'who' for people, 'that' for people or things, and 'which' for things in relative clauses.",
          "The person who called you is waiting",
          "The book that you recommended is excellent",
          "I have a car which is very reliable."
        ]
      },
      {
        "title": "Examples",
        "content": "Let's examine examples to illustrate the application of relative clauses:",
        "points": [
            "The girl who won the competition is my friend",
            "The house that I visited yesterday is for sale.",
            "I have a friend whose brother works in the same company"
        ]
      },
      {
        "title": "Usage and Content",
        "content": "Understand the appropriate contexts for using relative clauses with 'who,' 'that,' and 'which' and how they contribute to the overall meaning of a sentence."
      },
      {
        "title": "Recap and Summary:",
        "content": "Address common mistakes related to the choice of relative pronouns and the structure of relative clauses."
      },
      {
        "title": "Additional Resources:",
        "content": "For additional practice and reinforcement, consider exploring examples in language learning books and online exercises."
      },
      {
        "title": "Conclusion",
        "content": "Thank you for joining today's lesson on 'Relative Clauses 1: Clauses with who/that/which.' Practice using these relative pronouns confidently in various situations, and feel free to reach out if you have any questions. Happy learning!"
      }
    ]
  }