{
    "day": 2,
    "topic": "Relative Clauses 2: Clauses with and without who/that/which",
    "sections": [
      {
        "title": "Introduction",
        "content": "Welcome to Unit 93 of our English learning journey. In this unit, we'll further explore the intricacies of relative clauses, both with and without the use of relative pronouns 'who,' 'that,' and 'which.'"
      },
      {
        "title": "Definition",
        "content": "Understanding the flexibility in constructing relative clauses enhances your ability to convey information in diverse ways. Let's delve into the key concepts."
      },
      {
        "title": "Relative Clauses",
        "content": "Relative Clauses with Pronouns",
        "points": [
          "The woman who is sitting there is my sister"
        ]
      },
      {
        "title": "Relative Clauses",
        "content": "Relative Clauses without Pronouns",
        "points": [
          "Explore instances where relative pronouns can be omitted in defining relative clauses.",
          "The woman I saw yesterday is a famous actress",
          "The car he drives is very expensive"
        ]
      },
      {
        "title": "Examples",
        "content": "Let's examine examples to illustrate the application of relative clauses with and without relative pronouns:",
        "points": [
            "The movie that we watched last night was fantastic.",
            "The teacher I spoke to at the conference was very knowledgeable",
            "The company, which was founded in 1990, is now a global leader"
        ]
      },
      {
        "title": "Usage and Content",
        "content": "Understand the appropriate contexts for using relative clauses both with and without relative pronouns and how they contribute to the overall meaning of a sentence."
      },
      {
        "title": "Recap and Summary:",
        "content": "In summary, mastering the use of relative clauses with and without relative pronouns provides flexibility and variety in your expression."
      },
      {
        "title": "Additional Resources:",
        "content": "For additional practice and reinforcement, consider exploring examples in language learning books and online exercises"
      },
      {
        "title": "Conclusion",
        "content": "Thank you for joining today's lesson on 'Relative Clauses 2: Clauses with and without who/that/which.' Practice using these structures confidently in various situations, and feel free to reach out if you have any questions. Happy learning!"
      }
    ]
  }